import React, { ReactNode } from "react";
import i711 from "../images/711.png";
import i712 from "../images/712.png";
import i713 from "../images/713.png";
import i751 from "../images/751.jpg";
import i752 from "../images/752.png";
import i771 from "../images/771.jpg";
import i772 from "../images/772.png";
import i773 from "../images/773.png";
import i774 from "../images/774.png";

type Props = {};

export const ClassPages: Record<string, Record<string, ReactNode>> = {
  "7": {
    "1": (
      <div>
        <b>1.Строение вещества</b>
        <p>
          В физике всегда стремятся объяснить причину возникновения физически
          явлений. Haпримep: Почему вода растекается, когда ee проливают на пол,
          a на горячей сковородке она собирается в капли? Почему газ легко
          сжать, a твepдoe тело и жидкость — очень трудно? Почему нагретый кусок
          стали легче изогнуть или расплющить, чем холодный? Чтобы ответить на
          многие вопросы, нужно знать строение вещества. Зная строение вещества,
          можно объяснить как будет происходить явление, или как его, например,
          ускорить или замедлить. Зная строение тел, учeныe объясняют их
          свойства и создают новые вещества, например, пластмассы, искусственный
          каучук, капрон и др.
        </p>
        <p>
          О том, что все тела состоят из мельчайших частиц, позволяют судить
          некоторые простые опыты.
        </p>
        <p>
          Попытаемся сжать теннисный мячик. При этом объём воздуха, который
          заполняет мяч, уменьшится. Можно уменьшить и объём на­дувного шарика,
          и кусочка воска, если прило­жить некоторое усилие.
        </p>
        <p>Объём тела изменяется также при его нагре­вании и охлаждении.</p>
        <p>
          Проделаем опыт. Возьмём медный или латун­ный шарик, который в
          ненагретом состоянии проходит сквозь кольцо. Если шарик нагреть, то,
          расширившись, он уже сквозь кольцо не пройдет. Через некоторое время
          шарик, остыв, уменьшится в объёме, а кольцо, нагревшись от шарика,
          расширится, и шарик вновь пройдет сквозь кольцо.
        </p>
        <img src={i711} alt="711" />
        <img src={i712} alt="712" />
        <p>
          <b>
            Следовательно, при нагревании объём тела увеличивается, а при
            охлаждении уменьшается.
          </b>
        </p>
        <p>
          Попытаемся объяснить, почему происходит изменение объёма тела.
          По-видимому, все вещества состоят из от­дельных частичек, между
          которыми имеются промежутки. Если частицы удаляются друг от друга, то
          объём тела увеличивается. И наоборот, когда частицы сближаются, объём
          тела уменьшается.
        </p>
        <p>
          Тогда возникает вопрос: если все тела состоят из мельчайших частиц,
          почему они кажутся нам сплошными (например, железо, вода, стекло,
          дерево)?
        </p>
        <p>
          Современная наука доказала, что частицы вещества так малы, что мы их
          не видим. Для того чтобы убедиться в том, что частицы вещества малы,
          проделаем опыт.
        </p>
        <p>
          В сосуде с водой растворим маленькую кру­пинку марганцовки. Через
          некоторое время вода в нём станет малиновой. Отольём немного
          окрашенной воды в другой сосуд и дольём в него чистую воду. Раствор во
          втором сосуде будет окрашен слабее, чем в первом. Потом из второго
          сосуда снова отольём раствор уже в третий сосуд и дольём его вновь
          чистой водой. В этом сосуде вода будет окрашена ещё слабее, чем во
          втором. Поскольку в воде растворили очень маленькую крупинку
          марганцовки и только часть её попала в третий сосуд, то можно
          предположить, что крупинка состояла из большого числа мельчайших
          частиц.
        </p>
        <p>
          Этот опыт и многие другие подтверждают гипотезу о том, что вещества
          состоят из очень маленьких частиц.
        </p>
        <img src={i713} alt="713" />
      </div>
    ),
    "2": (
      <div>
        <b>2. Молекулы</b>
        <p>
          Все вещества состоят из отдельных частиц, между которыми есть
          промежутки, - это предположение было доказано современной наукой.
          Частицы были названы молекулами (в переводе с латинского “маленькая
          масса”)
        </p>
        <p>
          Даже небольшие тела состоят из огромного числа молекул. Так, например,
          в крупинке сахара содержится очень большое число молекул. Подсчитано,
          что в 1 см3 воздуха находится около 27 • 10^18 молекул. Чтобы понять,
          насколько велико это число, представим следующее. Че­рез маленькое
          отверстие пропускают по мил­лиону молекул в секунду, тогда указанное
          ко­личество молекул пройдёт через отверстие за 840 000лет.
        </p>
        <p>
          Молекулы разных веществ отличаются друг от друга, a молекулы одного и
          того же вещества одинаковы.
        </p>
        <p>
          Например: Воду, полученную из сока, не отличишь от воды, полученной из
          молока или от воды, полученной из морской воды. Все молекулы воды
          одинаковы. Из таких молекул не может состоять никакое другое вещество.
          Молекулы состоят из ещё более мелких частиц — атомов. Hапример:
          Молекулы воды состоит из двух атомов водорода и одного атома
          кислорода.
        </p>
      </div>
    ),
    "3": (
      <div>
        <b>3. Броуновское движение</b>
        <p>
          Любое вещество состоит из мельчайших частиц — молекул. <b>Молекула</b>{" "}
          — это наименьшая частица данного вещества, сохраняющая все его
          химические свойства. Молекулы расположены в пространстве дискретно, т.
          е. на некоторых расстояниях друг от друга, и находятся в состоянии
          непрерывного{" "}
          <b>
            <i>беспорядочного (хаотичного) движения.</i>
          </b>
        </p>
        <p>
          К числу основных опытных доказательств того, что молекулы движутся,
          относится явление, которое первым наблюдал в 1827 г. английский
          ботаник Роберт Броун, рассматривая в микроскоп перемещение спор
          растений, находящиеся в жидкости. Можно увидеть, что молекулы
          непрерывно движутся. Самые мелкие из них беспорядочно (хаотически)
          перемещаются с одного места в другое, более крупные лишь беспорядочно
          колеблются. Поэтому движение очень мелких твёрдых частиц, находящихся
          в жидкости, и называют <b>броуновским</b> движением, а саму частицу -{" "}
          <b>броуновской.</b>
        </p>
        <p>
          Наблюдения показывают, что броуновское движение никогда не
          прекращается. В капле воды (если не давать ей высохнуть) движение
          крупинок можно наблюдать в течение многих дней, месяцев, лет. Оно не
          прекращается ни летом, ни зимой, ни днём, ни ночью. В кусках кварца,
          пролежавших в земле тысячи лет, попадаются иногда капельки воды,
          замурованные в нём. В этих капельках тоже наблюдали броуновское
          движение плавающих в воде частиц.
        </p>
        <p>
          Причина броуновского движения заключается в непрерывном, никогда не
          прекращающемся движении молекул жидкости (газа), в которой находятся
          крупинки твёрдого тела.
        </p>
        <p>
          Открытие броуновского движения имело большое значение для изучения
          строения вещества. Оно показало, что{" "}
          <b>
            <i>
              тела действительно состоят из отдельных частиц - молекул и что
              молекулы находятся в непрерывном беспорядочном движении.
            </i>
          </b>
        </p>
      </div>
    ),
    "4": (
      <div>
        <b>4. Диффузия в газах, жидкостях и твердых телах</b>
        <p>
          Всем хорошо известно, что если в комнату внести какое-либо пахучее
          вещество, например духи или кофе, то запах вскоре будет чувствоваться
          во всей комнате. Распространение запахов происходит из-за того, что
          молекулы духов (или кофе) движутся. Они на своём пути сталкиваются с
          молекулами газов, которые входят в состав воздуха. Молекулы постоянно
          меняют направление движения и, беспорядочно перемещаясь, разлетаются.
          по комнате. Распространение запаха является доказательством
          непрерывного и беспорядочного движения молекул.
        </p>
        <p>
          <b>
            Явление, при котором происходит взаимное проникновение молекул
            одного вещества между молекулами другого, называют диффузией.
          </b>
        </p>
        <p>Скорость диффузии зависит от:</p>
        <p>1) температуры;</p>
        <p>2) механического перемешивания.</p>
        <p>Примеры диффузий:</p>
        <p>
          1. Налить холодной воды в ёмкость, положить туда марганцовку,
          подогреть или размешать механическими движениями.
        </p>
        <p>
          2. Добавление соли в воду, перемешивание механическими движениями (для
          бульона, например).
        </p>
        <p>
          3. Добавление сахара в чай путём механических размешиваний (движений).
        </p>
        <p>4. Распрыскивание духов в комнате.</p>
        <p>5. На соду налить уксус – происходит шипение, потом гаснет.</p>
        <p>
          6. Налить в ёмкость раствор медного купороса и сверху долить чистой
          воды. Вскоре они смешаются.
        </p>
        <p>7. Смешивание свинца и золота.</p>
        <p>
          8. Побрызгать из пульверизатора холодной водой в жарком помещении,
          станет прохладнее.
        </p>
        <p>
          Диффузия доказывает, что молекулы движутся, а также наличие
          промежутков между молекулами.
        </p>
      </div>
    ),
    "5": (
      <div>
        <b>5. Взаимное притяжение и отталкивание молекул</b>
        <p>
          Молекулы в веществе разделены промежутками и находятся в непрерывном
          беспорядочном движении. Однако между молекулами существует взаимное
          притяжение. Каждая молекула притягивает к себе соседние молекулы.
        </p>
        <p>
          Когда мы разрываем нить, ломаем палку или отрываем кусочек бумаги, то
          преодолеваем силы притяжения между молекулами. Заметить притяжение
          между двумя молекулами совершенно невозможно. Когда же притягиваются
          многие миллионы таких частиц, взаимное притяжение становится
          значительным. Поэтому трудно разорвать руками верёвку или стальную
          проволоку.
        </p>
        <p>
          Притяжение между молекулами в разных веществах неодинаково, поэтому
          прочность тел различна. Например: легко разорвать лист бумаги, но
          трудно разбить кирпич. Можно разбить стекло, но невозможно разбить
          стальную деталь.
        </p>
        <p>
          Между молекулами существует взаимное притяжение, которое заметно
          только на расстояниях, сравнимых c размерами самих молекул. На
          расстоянии, превышающем размеры самих молекул, притяжение ослабевает.
        </p>
        <p>
          Например: Две капли воды сливаются, если они соприкасаются. Два
          свинцовых цилиндра не оторвать друг от друга даже под действием груза,
          если их вплотную прижать друг к другу отполированными поверхностями.
          Но осколки стекла нельзя срастить из-за их неровностей. Однако
          нагретое стекло размягчается, осколки можно сблизить, и тем самым
          спаять. Здесь молекулы оказались на расстоянии не больше, чем размер
          молекулы.
        </p>
        <img src={i751} alt="751" />
        <p>
          Некоторые явления, происходящие в природе, можно объяснить притяжением
          молекул друг к другу, например <b>смачивание</b> твёрдого тела
          жидкостью. В пружине подвешивают на нитке стеклянную пластинку так,
          чтобы её нижняя поверхность была расположена горизонтально. Эту
          пластинку подносят к сосуду с водой так, чтобы она легла на
          поверхность воды. При отрывании пластинки от воды пружина заметно
          растянется. Это доказывает существование притяжения между молекулами.
        </p>
        <img src={i752} alt="752" />
        <p>
          Когда наблюдается <b>несмачиваемостъ,</b> то это означает, что
          молекулы жидкости притягиваются сильнее друг к другу, чем к молекулам
          твёрдого тела.
        </p>
      </div>
    ),
    "6": (
      <div>
        <b>6.Агрегатные состояния вещества</b>
        <p>Многие вещества могут находиться в трёх агрегатных состояниях.</p>
        <p>
          Во всех агрегатных состояниях вид молекул остаётся неизменным.
          Меняются расстояния между молекулами, а также их поведение.
        </p>
        <p>
          В <b>газах</b> расстояние между молекулами намного больше размеров
          самих молекул. На таких расстояниях молекулы почти не взаимодействуют
          между собой. Поэтому газы не имеют фиксированной формы и объёма.
        </p>
        <p>
          В <b>жидкостях</b> молекулы находятся на расстоянии, соизмеримом с
          размерами молекулы. На таких расстояниях между молекулами возникают
          сила притяжения и сила отталкивания. Они не такие большие, как в
          твёрдых телах, поэтому жидкости имеют фиксированный объём, но
          принимают форму сосуда, в который их наливают.
        </p>
        <p>
          В <b>твёрдых телах</b> расстояние между молекулами примерно такое же,
          как в жидкости. Но силы взаимодействия больше. Из-за этого каждая
          частица сохраняет своё положение по отношению к соседям. Такие связи
          называют «кристаллической решёткой». У некоторых твёрдых тел нет
          «кристаллической решётки», они называются «аморфные» и обладают
          текучестью, подобно жидкости.
        </p>
      </div>
    ),
    "7": (
      <div>
        <b>
          7. Различие в молекулярном строении твердых тел, жидкостей и газов
        </b>
        <p>
          Ранее вы изучали свойства твёрдых тел, жидкостей и газов. Объяснить
          свойства веществ можно, если знать их молекулярное строение.
          <b>
            <i>
              Одно и то же вещество может находиться в различных состояниях.
            </i>
          </b>
        </p>
        <p>
          Так, например, вода, замерзая, становится твёрдым телом (лёд), а при
          кипении обращается в газообразное состояние (пар). Это три состояния
          одного и того же вещества (воды) — жидкое, твёрдое и газообразное. А
          если все три состояния воды — это состояния одного и того же вещества,
          значит, и молекулы его не отличаются друг от друга. Отсюда можно
          сделать вывод, что различные свойства вещества во всех состояниях
          определяются тем, что его молекулы расположены иначе и движутся
          по-разному.
        </p>
        <p>
          Если газ сжимается и объём его уменьшается, следовательно, в газах
          расстояние между молекулами намного больше размеров самих молекул.
          Поскольку в среднем расстояния между молекулами в десятки раз больше
          размера молекул, то они слабо притягиваются друг к другу.
        </p>
        <p>
          <b>
            <i>
              Молекулы газа, двигаясь во всех направлениях, почти не
              притягиваются друг к другу и заполняют весь сосуд. Газы не имеют
              собственной формы и постоянного объёма.
            </i>
          </b>
        </p>
        <p>
          Молекулы жидкости расположены близко друг к другу. Расстояния между
          каждыми двумя молекулами меньше размеров молекул, поэтому притяжение
          между ними становится значительным.
        </p>
        <p>
          <b>
            <i>
              Молекулы жидкости не расходятся на большие расстояния, и жидкость
              в обычных условиях сохраняет свой объём, но не сохраняет форму.
            </i>
          </b>
        </p>
        <p>
          Поскольку притяжение между молекулами жидкости не так велико, то они
          могут скачками менять своё положение. Жидкость не сохраняет свою форму
          и принимает форму сосуда. Они текучи, их легко перелить из одного
          сосуда в другой.
        </p>
        <p>
          Жидкость трудно сжимается, так как при этом молекулы сближаются на
          расстояние, когда заметно проявляется отталкивание.
        </p>
        <p>
          <b>
            <i>
              В твёрдых телах притяжение между молекулами (атомами) ещё больше,
              чем у жидкостей. Поэтому в обычных условиях твёрдые тела сохраняют
              свою форму и объём.
            </i>
          </b>
        </p>
        <p>
          В твёрдых телах молекулы (атомы) расположены в определённом порядке.
          Это лёд, соль, металлы и др. Такие тела называются кристаллами.
        </p>
        <img src={i771} alt="771" />
        <p>
          Молекулы или атомы твёрдых тел колеблются около определённой точки и
          не могут далеко переместиться от неё. Твёрдое тело поэтому сохраняет
          не только объём, но и форму.
        </p>
        <p>
          Расположение молекул воды в трёх разных состояниях показано на рисунке
          31: газообразном — водяной пар (рис. 31, в), жидком — вода (рис. 31,
          б) и твёрдом — лед (рис. 31, а).
        </p>
        <img src={i773} alt="773" />
        <img src={i772} alt="772" />
        <img src={i774} alt="774" />
      </div>
    ),
    "8": (
      <div>
        <b>8. Механическое движение</b>
        <p>
          <b>Механическим движением</b> тела называют изменение положения тела в
          пространстве относительно других тел с течением времени.
        </p>
        <p>
          Тело, по отношению к которому рассматривается данное механическое
          движение, называют <b>телом отсчёта.</b>
        </p>
        <p>
          Линию, по которой движется тело, называют{" "}
          <b>траекторией движения тела.</b>
        </p>
        <p>
          Длину траектории, по которой движется тело в течение некоторого
          промежутка времени, называют <b>пройденным путём.</b>
        </p>
        <p>
          Путь обозначают буквой s. Путь – это физическая величина, которую
          можно измерить. Основной единицей пути в Международной системе (СИ)
          является метр (м). Используются и другие единицы длины: миллиметр
          (мм), сантиметр (см), дециметр (дм) и километр (км).
        </p>
        <p>1 мм = 0,001 м; 1 дм = 0,1 м;</p>
        <p>1 см = 0,01 м; 1 км = 1000 м.</p>
      </div>
    ),
    "9": (
      <div>
        <b>9. Равномерное и неравномерное движение</b>
        <p>
          Если тело за любые равные промежутки времени проходит равные пути, то
          его движение называют <b>равномерным.</b>
        </p>
        <p>
          Если тело за равные промежутки времени проходит разные пути, то его
          движение называют <b>неравномерным.</b>
        </p>
        <p>
          Например, при движении тележки под действием привязанного к ней груза
          мы видим, что расстояния между следами от капель неодинаковые – это и
          означает, что за одинаковые промежутки времени тележка проходит разные
          пути.
        </p>
      </div>
    ),
    "10": (
      <div>
        <b>10. Скорость. Единицы скорости</b>
        <p>
          <b>Скорость</b> – это физическая величина, характеризующая быстроту
          движения.
        </p>
        <p>
          <i>
            Скорость при равномерном движении тела показывает, какой путь оно
            прошло в единицу времени.
          </i>
        </p>
        <p>
          <i>При равномерном движении скорость тела остаётся постоянной.</i>
        </p>
        <p>
          <i>
            Чтобы определить скорость при равномерном движении, надо путь,
            пройденный телом за какой-то промежуток времени, разделить на этот
            промежуток времени.
          </i>
        </p>
        <p>
          Скорость = путь / время Скорость обозначают буквой <b>υ</b>, путь –{" "}
          <b>s</b>, время – <b>t</b>{" "}
        </p>
        <p>
          <b>
            Скорость тела при равномерном движении - это величина, равная
            отношению пути ко времени, за которое этот путь пройден.
          </b>
        </p>
        <p>
          В Международной системе (СИ) скорость измеряют в метрах в секунду
          (м/с).
        </p>
        <p>
          Это значит, что за единицу скорости принимается скорость такого
          равномерного движения, при котором за 1 секунду тело проходит путь
          равный 1 метру.
        </p>
        <p>
          Скорость тела можно измерять также в километрах в час (км/с);
          километрах в секунду (км/с); сантиметрах в секунду (см/с).
        </p>
        <p>
          Скорость, кроме числового значения, имеет направление. Величины,
          которые кроме числового значения (модуля), имеют ещё и направление,
          называют <b>векторными.</b>
        </p>
        <p>
          Некоторые физические величины не имеют направления: путь, время,
          объем, дина и др. Они являются скалярными величинами.
        </p>
        <p>
          Если при движении тела его скорость изменяется от одного участка пути
          к другому, то такое движение является неравномерным. Для
          характеристики неравномерного движения тела вводят понятие{" "}
          <b>средней скорости.</b>
        </p>
      </div>
    ),
    "11": (
      <div>
        <b>11. Инерция</b>
        <p>
          Изменение скорости тела (величины и направления) происходит в
          результате действия на него другого тела.
        </p>
        <p>
          Установим наклонно на столе доску. Насыплем на стол, на небольшом
          расстоянии от конца доски, горку песка. Поместим на наклонную доску
          тележку. Тележка, скатившись с доски на стол и попав в песок, быстро
          останавливается. На своём пути тележка встречает препятствие в виде
          песка. Скорость тележки уменьшается очень быстро. Её движение
          неравномерно.
        </p>
        <p>
          Явление сохранения скорости тела при отсутствии действия на него
          других тел называют <b>инерцией.</b>
        </p>
        <p>
          Если на тело не действуют другие тела, то оно движется с постоянной
          скоростью.
        </p>
        <p>
          <b>Перемещение</b> – это физическая величина, численно равная длине
          отрезка, соединяющего начальное положение тела с конечным.
        </p>
      </div>
    ),
    "12": (
      <div>
        <b>12. Взаимодействие тел</b>
        <p>
          Действие тел друг на друга называется взаимодействием. В результате
          взаимодействия оба тела могут изменить свою скорость – начать движение
          или остановиться, а также изменить направление своего движения.
        </p>
        <p>
          Инертность – свойство тела сохранять состояние покоя или, если тело
          двигалось, свою скорость.
        </p>
        <p>
          Масса тела – это физическая величина, характеризующая меру его
          инертности. В Международной системе единиц СИ за единицу массы принят
          килограмм.
        </p>
      </div>
    ),
  },
};
