export const CLASSES = [5, 6, 7, 8, 9, 10, 11];

export const THEMES: Record<number, Array<{ url: string; name: string }>> = {
  7: [
    { url: "7/1", name: "1. Строение вещества" },
    { url: "7/2", name: "2. Молекулы" },
    { url: "7/3", name: "3. Броуновское движение" },
    { url: "7/4", name: "4. Диффузия в газах, жидкостях и твердых телах" },
    { url: "7/5", name: "5. Взаимное притяжение и отталкивание молекул" },
    { url: "7/6", name: "6. Агрегатные состояния вещества" },
    {
      url: "7/7",
      name: "7. Различие в молекулярном строении твердых тел, жидкостей и газов",
    },
    { url: "7/8", name: "8. Механическое движение" },
    { url: "7/9", name: "9. Равномерное и неравномерное движение" },
    { url: "7/10", name: "10. Скорость. Единицы скорости" },
    { url: "7/11", name: "11. Инерция" },
    { url: "7/12", name: "12. Взаимодействие тел" },
    { url: "7/13", name: "13. Масса тела. Единицы массы" },
    { url: "7/14", name: "14. Измерения массы тела на весах" },
    { url: "7/15", name: "15. Плотность вещества" },
    { url: "7/16", name: "16. Явление тяготения. Сила тяжести." },
    { url: "7/17", name: "17. Сила упругости. Закон гука." },
    { url: "7/18", name: "18. Вес тела" },
    { url: "7/19", name: "19. Сила трения" },
    { url: "7/20", name: "20. Давление" },
    {
      url: "7/21",
      name: "21. Давление газа. Передача давления жидкостями и газами. Закон Паскаля",
    },
    { url: "7/22", name: "22. Сообщающиеся сосуды" },
    { url: "7/23", name: "23. Вес воздуха. Атмосферное давление" },
    {
      url: "7/24",
      name: "24. Измерение атмосферного давления. Опыт Торричелли",
    },
  ],
};
