export const CLASSES = [5, 6, 7, 8, 9, 10, 11];

export const THEMES: Record<number, Array<{ url: string; name: string }>> = {
  7: [
    { url: "7/1", name: "1. Строение вещества" },
    { url: "7/2", name: "2. Молекулы" },
    { url: "7/3", name: "3. Броуновское движение" },
    { url: "7/4", name: "4. Диффузия в газах, жидкостях и твердых телах" },
    { url: "7/5", name: "5. Взаимное притяжение и отталкивание молекул" },
    { url: "7/6", name: "6. Агрегатные состояния вещества" },
    {
      url: "7/7",
      name: "7. Различие в молекулярном строении твердых тел, жидкостей и газов",
    },
  ],
};
